Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: This value corresponds to the category Surrogate (abbreviated Cs) in the Unicode Standard.
ja: この値は、Unicode StandardにおけるSurrogate（簡略形式Cs）に相当します。

source: This value corresponds to the category Titlecase_Letter (abbreviated Lt) in the Unicode Standard.
ja: この値は、ユニコード標準におけるTitlecase_Letter（簡略形式Lt）に相当します。

source: This value corresponds to the category Unassigned (abbreviated Cn) in the Unicode Standard.
ja: この値は、Unicode StandardにおけるUnassigned（簡略形式Cn）に相当します。

source: This value corresponds to the category Uppercase_Letter (abbreviated Lu) in the Unicode Standard.
ja: この値は、ユニコード標準におけるUppercase_Letter（簡略形式Lu）に相当します。

source: This value is nil for code points that have not yet been assigned.
ja: この値は、まだ割り当てられていないコード点に対してnilです。

source: Those “pairs” of code units are called surrogate pairs.
ja: それら「ペア」のコード単位は、サロゲートペアと呼ばれます。

source: Though similar in name, this property is not equivalent to changesWhenCaseMapped.
ja: 名前が似ているにもかかわらず、このプロパティはchangesWhenCaseMappedと等しくありません。

source: Thus, creating a slice has O(1) complexity.
ja: したがって、ある切り取り（スライス）の作成はO(1)の計算量を持ちます。

source: To await the results of a completion handler in these cases, add a continuation:
ja: それらの場合に完了ハンドラの結果をawaitするには、continuationを加えてください：

source: To access the stride, use MemoryLayout<Pointee>.stride.
ja: ストライドにアクセスするには、MemoryLayout<Pointee>.strideを使ってください。

source: To access the underlying memory through typed operations, the memory must be bound to a trivial type.
ja: 型付演算を通して基礎をなすメモリにアクセスするには、メモリは自明型に束縛されなければなりません。

source: To access the underlying memory, invoke withUnsafeBufferPointer on the array.
ja: 基礎をなすメモリにアクセスするには、withUnsafeBufferPointerを配列上で発動してください。

source: To add Strideable conformance to a custom type, choose a Stride type that can represent the distance between two instances and implement the advanced(by:) and distance(to:) methods.
ja: Strideable準拠をあつらえの型に加えるには、２つのインスタンスの間の隔たりを表現可能であるStride型のひとつを選んで、advanced(by:)とdistance(to:)メソッドを実装してください。

source: To add TextOutputStreamable conformance to a custom type, implement the required write(to:) method.
ja: TextOutputStreamable準拠をあつらえの型に加えるには、必須write(to:)メソッドを実装してください。

source: To add the complication to an active watch face, start by building and running the sample code project in the simulator, and follow these steps:
ja: コンプリケーションをアクティブなウォッチフェイスに加えるには、見本コードプロジェクトをシミュレータにおいてビルドおよび実行することによって始めます、そしてこれらの段階に従ってください：

source: To add values of different types, convert one of the values to the other value’s type.
ja: 異なる型の値を加算するには、それらの値の一方を、他方の値の型へと変換してください。

source: To avoid the unexpected copy, use the index(after:) method starting with startIndex to produce indices instead.
ja: 予期されないコピーを避けるために、代わりにindex(after:)メソッドを使ってstartIndexで始めることで、インデックスを生成してください。

source: To bind a region of memory to a type that is a different size, convert the buffer to a raw buffer and use the bindMemory(to:) method.
ja: あるメモリ領域を異なるサイズの型に束縛するには、そのバッファを新しい生のバッファに変換して、bindMemory(to:)メソッドを使ってください。

source: To bind a region of memory to a type that is a different size, convert the pointer to a raw pointer and use the bindMemory(to:capacity:) method.
ja: メモリのある領域を異なるサイズである型にバインドするには、ポインタを生のポインタに変換して、bindMemory(to:capacity:)メソッドを使ってください。

source: To bind memory to T, use bindMemory(to:capacity:) instead of this method.
ja: メモリをTに束縛するには、bindMemory(to:capacity:)をこのメソッドの代わりに使ってください。

source: To bind uninitialized memory to a type without initializing it, use the bindMemory(to:count:) method.
ja: 未初期化メモリをそれを初期化することなくある型に束縛するには、bindMemory(to:count:)メソッドを使用してください。

source: To call countLetterChanges(_:_:) with two strings, use an unbounded range in each string’s subscript.
ja: countLetterChanges(_:_:)を２つの文字列で呼び出すには、無境界範囲を各文字列の添え字において使ってください。

source: To cancel a group, call the TaskGroup.cancelAll() method.
ja: グループを取り消すには、TaskGroup.cancelAll()メソッドを呼び出してください。

source: To cancel a group, call the ThrowingTaskGroup.cancelAll() method.
ja: グループを取り消すには、ThrowingTaskGroup.cancelAll()メソッドを呼び出してください。

source: To check whether x is represented by a surrogate pair, use UTF16.width(x) == 2.
ja: xがあるサロゲートペアで表現されるかどうか調べるには、UTF16.width(x) == 2を使ってください。

source: To check whether a collection is empty, use its isEmpty property instead of comparing count to zero.
ja: あるコレクションが空かどうか調べるには、それのisEmptyプロパティを使ってください、countをゼロと比較するのでなく。

source: To check whether a string is empty, use its isEmpty property instead of comparing the length of one of the views to 0.
ja: ある文字列が空かどうか調べるには、それのisEmptyプロパティを使ってください、ビューの内の１つの長さを0と比較するのでなく。

source: To conform to Hashable, implement the hash(into:) requirement instead.
ja: Hashableに準拠するには、hash(into:)要件を代わりに実装してください。

source: To construct a selector for a property’s Objective-C getter or setter method, prefix the property name using the getter: or setter: label, like #selector(getter: MyViewController.myButton).
ja: セレクタをあるプロパティの持つObjective-Cゲッターまたはセッターメソッドに対して組み立てるには、プロパティ名にgetter:またはsetter:ラベルを使って接頭辞を付けてください、#selector(getter: MyViewController.myButton)のように。

source: To convert a String.UTF16View instance back into a string, use the String type’s init(_:) initializer.
ja: String.UTF16Viewインスタンスを逆に文字列へと変換するには、String型のもつinit(_:)イニシャライザを使ってください。

source: To convert an NSRange instance to a range of String.Index, use the Range(_:in:) initializer, which takes an NSRange and a string as arguments.
ja: NSRangeインスタンスをString.Indexの範囲へ変換するには、Range(_:in:)イニシャライザを使ってください、それはNSRangeと文字列を引数として取ります。

source: To create a Zip2Sequence instance, use the zip(_:_:) function.
ja: Zip2Sequenceインスタンスを作成するには、zip(_:_:)関数を使ってください。

source: To create a continuation in asynchronous code, call the withUnsafeContinuation(_:) or withUnsafeThrowingContinuation(_:) function.
ja: ある継続を非同期コードにおいて作成するには、withUnsafeContinuation(_:)またはwithUnsafeThrowingContinuation(_:)関数を呼び出してください。

source: To create a task group, call the withTaskGroup(of:returning:body:) method.
ja: タスクグループを作成するには、withTaskGroup(of:returning:body:)メソッドを呼び出してください。

source: To decode a code unit sequence completely, call this method repeatedly until it returns UnicodeDecodingResult.emptyInput.
ja: あるコード単位のシーケンスを完全にデコードするには、このメソッドを繰り返し、それがUnicodeDecodingResult.emptyInputを返すまで呼び出してください。

source: To demonstrate the different views available for every string, the following examples use this String instance:
ja: あらゆる文字列で利用可能な異なるビューを実際に示すために、以降の例はこのStringインスタンスを使います：

source: To ensure that all updates to this property are made on the main thread, place the type on the main actor:
ja: このプロパティへの全ての更新がメインスレッド上でなされることを確実にするために、その型をメインアクター上に置いてください：

source: To find individual elements of a string, use the appropriate view for your task.
ja: ある文字列の個々の要素を手に入れるには、あなたの作業に適切なビューを使ってください。

source: To find the distance in bytes between two pointers, convert them to UnsafeRawPointer instances before calling distance(to:).
ja: ２つのポインタの間の隔たりをバイトで知るには、それらをUnsafeRawPointerインスタンスに、distance(to:)を呼ぶ前に変換してください。

source: To find the index of the day in question, follow these steps:
ja: 質問の日付のインデックスを見つけるには、これらの手順に従ってください：

source: To get an instance of UnsafeCurrentTask for the current task, call the withUnsafeCurrentTask(body:) method.
ja: UnsafeCurrentTaskのインスタンスを現在のタスクに対して取得するには、withUnsafeCurrentTask(body:)メソッドを呼び出してください。

source: To iterate over the elements of a collection with its indices, use the zip(_:_:) function.
ja: あるコレクションの要素すべてにわたってそれのインデックスで反復するには、zip(_:_:)関数を使ってください。

source: To make your custom type conform to the TextOutputStream protocol, implement the required write(_:) method.
ja: あなたのあつらえのクラスをTextOutputStreamプロトコルに準拠させるには、必須write(_:)メソッドを実装してください。

source: To multiply values of different types, convert one of the values to the other value’s type.
ja: 異なる型の値を乗算するには、それらの値の一方を、他方の値の型へと変換してください。

source: To perform all methods asynchronously, replace the currentDrinks property’s didSet operation with private(set) and add a new async method named drinksUpdated.
ja: 全てのメソッドを非同期に実行するには、currentDrinksプロパティのもつdidSet演算をprivate(set)で置き換えます、そして新しいasyncメソッドをdrinksUpdatedという名前で加えてください。

source: To protect the stored properties on the controller when accessed asynchronously, change HealthKitController from a class type to an actor:
ja: 格納プロパティをコントローラ上で非同期にアクセスされた時に保護するには、HealthKitControllerをclass型からactorへと変えてください：

source: To remove the last element of a collection that might be empty, use the popLast() method instead.
ja: 空であるかもしれないあるコレクションの最後の要素を削除するには、popLast()関数を使ってください。

source: To represent those scalar values using 8-bit integers, more than one UTF-8 code unit is often required.
ja: これらのスカラー値を8ビット整数で表すには、１つ以上のUTF-8コード単位がしばしば必要とされます。

source: To resume the asynchronous task, call the resume(returning:), resume(throwing:), resume(with:), or resume() method.
ja: 非同期タスクを再開するには、resume(returning:)、resume(throwing:)、resume(with:)、またはresume()メソッドを呼び出してください。

source: To sort the elements of your collection in descending order, pass the greater-than operator (>) to the sort(by:) method.
ja: あなたのコレクションの要素を降順にソートするには、より大きい演算子（>）をsort(by:)メソッドに渡してください。

source: To sort the elements of your sequence in descending order, pass the greater-than operator (>) to the sorted(by:) method.
ja: あなたのシーケンスの要素を降順にソートするには、より大きい演算子（>）をsorted(by:)メソッドに渡してください。

source: To sort your sequence in descending order, pass the greater-than operator (>) as the areInIncreasingOrder parameter.
ja: あなたのシーケンスを降順にソートするには、より大きい演算子（>）をareInIncreasingOrderパラメータとして渡してください。

source: To subtract values of different types, convert one of the values to the other value’s type.
ja: 異なる型の値を減算するには、それらの値の一方を、他方の値の型へと変換してください。

source: To use the default interpolation, conform a type to ExpressibleByStringInterpolation and implement init(stringLiteral: String).
ja: 省略時の補間を使うには、型をExpressibleByStringInterpolationに準拠させて、そしてinit(stringLiteral: String)を実装してください。

source: To use this interpolation method, create a string literal with an interpolation using the validating parameter label.
ja: この補間メソッドを使うには、validatingパラメータラベルを使用するある補間で文字列リテラルを作成してください。

source: Tools for Your Types
ja: あなたの型のためのツール

source: Topics
ja: 話題

source: Transforming a String's Characters
ja: 文字列のもつ文字を変形します

source: Translates the given input from one Unicode encoding to another by calling the given closure.
ja: 指定された入力をあるユニコード符号化から別のものへと指定されたクロージャを呼び出すことによって翻訳します。

source: Translation Between Unicode Encodings
ja: ユニコードエンコーディング間の変換

source: True if any lane of mask is true.
ja: マスクのどんなレーンもtrueならば、true。

source: True if every lane of mask is true.
ja: マスクのあらゆるレーンがtrueならば、true。

source: Two edge cases are worth particular attention:
ja: ２つの境界事例は特別な注意を払う価値があります：

source: Two elements are incomparable if neither is ordered before the other according to the predicate.
ja: ２つの要素は、述部によるとどちらもが他の前に並べられるならば比較できない。

source: Two methods that perform synchronous IO — the load and save methods — are factored out into a separate CoffeeDataStore actor, which performs these activities away from the main thread.
ja: 同期的なIOを実行する２つのメソッド — loadとsaveメソッド — それらは、ある隔てられたCoffeeDataStoreアクターへと抽出されます、それはこれらの活動をメインスレッドから離して実行します。

source: Two sequences are canonically equivalent if they are equal when sorting the scalars in ascending order by their combining class.
ja: ２つのシーケンスは、スカラーをそれらの結合クラスによって昇順でソートする場合にそれらが等しいならば、正準的に等しいです。

source: Type Aliases
ja: 型エイリアス

source: Type Casting and Existential Types
ja: 型キャストと存在型

source: Type Method
ja: 型メソッド

source: Type Methods
ja: 型メソッド

source: Type Properties
ja: 型プロパティ

source: Type Property
ja: 型プロパティ

source: Type aliases representing the concrete type that a literal takes when no other type information is provided.
ja: 具体的な型を表している型エイリアスで、それをリテラルが取るのは他の型情報が提供されない時です。

source: Type cast
ja: 型キャスト

source: Type check
ja: 型チェック

source: Type-Erasing Wrappers
ja: 型消去ラッパー

source: Typed Memory
ja: 型付メモリ

source: Typed Pointers
ja: 型付ポインタ

source: Typed pointers are required to be properly aligned for their Pointee type.
ja: 型付ポインタは、適切にそれらのPointee型にアラインされることを要求されます。

source: Types that have an integer Stride can be used as the boundaries of a countable range or as the lower bound of an iterable one-sided range.
ja: ある整数Strideを持つこれら型は、可付番範囲の境界としてまたは反復可能な片側範囲の下方境界として使われることができます。

source: Typical extenders are length and iteration marks.
ja: 典型的なエクステンダは、長さおよび反復マークです。

source: Typically, you use this to transform from one type of element to another.
ja: 概して、あなたはこれを使ってある型の要素から別のものへと変換します。

source: UTF-16 View
ja: UTF-16ビュー

source: UTF-8 View
ja: UTF-8ビュー

source: UTF16View Elements Match NSString Characters
ja: UTF16View要素はNSString文字に一致します

source: UTF8View Elements Match Encoded C Strings
ja: UTF8View要素は符号化C文字列と一致します

source: Unary minus
ja: 単項マイナス

source: Unary plus
ja: 単項プラス

source: Unconditionally create a child task in the group.
ja: 無条件にある子タスクをこのグループの中に作成します。

source: Unconditionally prints a given message and stops execution.
ja: 無条件に与えられたメッセージを出力して実行を停止します。

source: Understanding a Pointer’s Memory State
ja: あるポインタのメモリ状態を理解する

source: Unicode
ja: ユニコード

source: Unicode Codecs
ja: ユニコードコーデック

source: Unicode Scalar Classifications
ja: ユニコードスカラークラス分け

source: Unicode Scalar View
ja: ユニコードスカラービュー

source: Unicode scalar values are the 21-bit codes that are the basic unit of Unicode.
ja: ユニコードスカラー値は21ビットコードです、それはユニコードの基本的な単位です。

source: Unicode scalar values that make up a string’s contents can be up to 21 bits long.
ja: 文字列のもつ内容を構成するユニコードスカラー値は、21ビット長に至るまで可能です。

source: Uninitialized Memory
ja: 未初期化メモリ

source: Uninitialized memory must be initialized before it can be accessed for reading.
ja: 未初期化メモリは、それが読み出しのためアクセスされる前に初期化される必要があります。

source: Uninitialized memory must be initialized with values of a type before it can be used with any typed operations.
ja: 未初期化メモリは、それが何らかの型付き演算で使用される前にある型の値で初期化されなければなりません。

source: Uniqueness Checking
ja: 特有性の検査

source: UnkeyedDecodingContainer Implementations
ja: UnkeyedDecodingContainer 実装

source: UnkeyedEncodingContainer Implementations
ja: UnkeyedEncodingContainer 実装

source: Unless the collection conforms to the BidirectionalCollection protocol, start must be less than or equal to end.
ja: コレクションがBidirectionalCollectionプロトコルに準拠しない場合は、startはendより少ないか等しくなければなりません。

source: Unless the collection guarantees random-access performance, calculating count can be an O(n) operation.
ja: そのコレクションが無作為アクセス性能を保証しない限り、countの算出は、O(n)演算であるはずです。

source: Unless you’re implementing a scheduler, you don’t generally interact with jobs directly.
ja: あなたがあるスケジューラを実装しようとしているのでない限り、あなたは一般的にジョブそれらと直接に相互作用しません。

source: Unless you’re implementing a scheduler, you don’t generally interact with partial tasks directly.
ja: あなたがあるスケジューラを実装しようとしているのでない限り、あなたは一般的に部分的タスクそれらと直接に相互作用しません。

source: Unlike NSString, however, String.UTF16View does not use integer indices.
ja: しかしながら、NSStringとは違い、String.UTF16Viewは整数インデックスを使いません。

source: Unlike Task.detached, the task creating by the Task initializer inherits the priority and actor context of the caller, so the operation is treated more like an asynchronous extension to the synchronous operation.
ja: Task.detachedとは異なり、Taskイニシャライザによって作成されたタスクは、呼び出し側の優先度とアクター文脈を継承します、なのでoperationはむしろ同期演算のための非同期拡張に近いと見なされます。

source: Unlike Task.detached, the task created inherits the priority and actor context of the caller, so the operation is treated more like an asynchronous extension to the synchronous operation.
ja: Task.detachedとは異なり、作成されたタスクは、呼び出し側の優先度とアクター文脈を継承します、なのでoperationはむしろ同期演算のための非同期拡張に近いと見なされます。

source: Unlike other continuations YieldingContinuation may resume more than once.
ja: 他の継続とは違いYieldingContinuationは一度より多く再開するかもしれません。

source: Unlike traditional truncating multiplication, the multipliedFullWidth(by:) method returns a tuple containing both the high and low parts of the product of this value and other.
ja: 従来的な切り詰め乗算と違って、multipliedFullWidth(by:)メソッドは、この値とotherの積のhighおよびlow部分の両方を含んでいるタプルを返します。

source: Unlike with isEmpty, calculating a view’s count property requires iterating through the elements of the string.
ja: isEmptyとは違い、あるビューのcountプロパティを計算することはその文字列の要素を始めから終わりまで反復していく必要があります。

source: Unlike with other pointer types, you can't use an array as an implicitly bridged parameter.
ja: 他のポインタ型とは違い、あなたは配列を暗黙的にブリッジされるパラメータとして使用できません。

source: UnsafeBufferPointer Semantics
ja: UnsafeBufferPointer意味論

source: UnsafeMutableBufferPointer Semantics
ja: UnsafeMutableBufferPointer意味論

source: UnsafeMutableRawBufferPointer Semantics
ja: UnsafeMutableRawBufferPointer意味論

source: UnsafeRawBufferPointer Semantics
ja: UnsafeRawBufferPointer意味論

source: Unsafely converts an unmanaged class reference to a pointer.
ja: 管理されないクラス参照をポインタへと安全でない変換をする。

source: Unsafely turns an opaque C pointer into an unmanaged class reference.
ja: 不透明Cポインタの管理されないクラス参照への安全でない転換。

source: Unsigned Integers
ja: 符号なし整数

source: Unstructured Concurrency
ja: 構造化されない並行性

source: Update the drinksUpdated() method to call the CoffeeDataStore actor using an await call.
ja: drinksUpdated()メソッドを更新して、CoffeeDataStoreアクターをawait呼出を使って呼び出すようにください。

source: Updating an App to Use Swift Concurrency
ja: アプリをSwift並行性を使うように更新する

source: Upon reaching 6, the sequence ends:
ja: 6に到達することで、そのシーケンスは終わります：

source: Use Void or an empty tuple as the return type when declaring a closure, function, or method that doesn’t return a value.
ja: 値を返さないクロージャ、関数、またはメソッドを定義する場合は、Voidまたは空のタプルを戻り型として使ってください。

source: Use drop(while:) to omit elements from an asynchronous sequence until the element received meets a condition you specify.
ja: drop(while:)を使うことで要素を非同期シーケンスから、その受け取った要素があなたが指定する条件に合うまで省いてください。

source: Use dropFirst(_:) when you want to drop the first n elements from the base sequence and pass through the remaining elements.
ja: dropFirst(_:)を使ってください、あなたが最初のn要素を基底シーケンスから抜かす、そして残っている要素をずっと渡したい場合は。

source: Use prefix(_:) to reduce the number of elements produced by the asynchronous sequence.
ja: prefix(_:)を使って非同期シーケンスによって生み出された要素の数を減らしてください。

source: Use prefix(while:) to produce values while elements from the base sequence meet a condition you specify.
ja: prefix(while:)を使うことで、基底シーケンスからの要素があなたが指定する条件に合う間ずっと値を生み出してください。

source: Use Key Paths to Dynamically Access Objective-C Properties
ja: キーパスを使って動的にObjective-Cプロパティにアクセスする

source: Use Selectors to Arrange Calls to Objective-C Methods
ja: セレクタを使ってObjective-Cメソッドへの呼び出しを整える

source: Use a variable or constant with an existential type to hold an instance of any type.
ja: ある変数または定数を存在型とともに使うことで、どんな型のインスタンスでも保持するようになります。

source: Use bridged reference types when you need reference semantics or Foundation-specific behavior.
ja: ブリッジされた参照型を、あなたが参照意味論またはFoundation特有の挙動を必要とする場合に使ってください。

source: Use implicit pointer casting or bridging when calling functions that takes pointers as parameters.
ja: 暗黙的なポインタキャストまたはブリッジを、ポインタをパラメータとして取る関数を呼び出す場合に使ってください。

source: Use imported C types or call C variadic functions.
ja: インポートされたC型を使ったり、C可変長引数関数を呼び出します。

source: Use inout syntax to implicitly create a pointer to an instance of any type.
ja: インアウト構文を使って、任意の型のインスタンスへのポインタを暗黙的に作成してください。

source: Use key-path expressions to access properties dynamically.
ja: キーパス式を使ってプロパティに動的にアクセスします。

source: Use native Swift syntax to interoperate with types and functions in C and Objective-C.
ja: 本来のSwift構文を使ってCおよびObjective-Cでの型および関数と相互作用します。

source: Use raw pointers and buffers to access memory for loading and storing as raw bytes.
ja: 生のポインタとバッファを使って、ロードおよび格納のためにメモリに生のバイトとしてアクセスします。

source: Use selectors and key paths to interact with dynamic Objective-C APIs.
ja: セレクタとキーパスを使って動的Objective-C APIと相互作用してます。

source: Use slices only for transient computation.
ja: スライスを一時的な計算のためだけに使ってください。

source: Use the advanced(by:) method in generic code to offset a value by a specified distance.
ja: advanced(by:)メソッドを総称体コードにおいて使用して、ある値を指定された隔たりだけオフセットしてください。

source: Use the bindMemory(to:) method to bind the memory referenced by this buffer to the type T.
ja: bindMemory(to:)メソッドを使用して、このバッファによって参照されるメモリを型Tへと束縛してください。

source: Use the bindMemory(to:capacity:) method to bind the memory referenced by this pointer to the type T.
ja: bindMemory(to:capacity:)メソッドを使用して、このポインタによって参照されるメモリを型Tへと束縛してください。

source: Use the compactMap(_:) method to transform every element received from a base asynchronous sequence, while also discarding any nil results from the closure.
ja: compactMap(_:)メソッドを使うことで、基底非同期シーケンスから受け取ったあらゆる要素を変換してください、そして一方でまたあらゆるnil結果をクロージャから廃棄して。

source: Use the map(_:) method to transform every element received from a base asynchronous sequence.
ja: map(_:)メソッドを使うことで、基底非同期シーケンスから受け取ったあらゆる要素を変換してください。

source: Use the max(by:) method to determine the index of the day with the most absences.
ja: max(by:)メソッドを使って最も欠席者の多い日付のインデックスを判定してください。

source: Use the reduce(_:_:) method to produce a single value from the elements of an entire sequence.
ja: reduce(_:_:)メソッドを使って、あるシーケンス全体の要素それらからある単一の値を生成してください。

source: Use the reduce(into:_:) method to produce a single value from the elements of an entire sequence.
ja: reduce(into:_:)メソッドを使って、あるシーケンス全体の要素それらからある単一の値を生成してください。

source: Use the shuffle() method to randomly reorder the elements of an array.
ja: shuffle()メソッドを使って、配列の要素を無作為に再配列してください。

source: Use the stride(from:through:by:) function to create StrideThrough instances.
ja: stride(from:through:by:)関数を使ってStrideThroughインスタンスを作成してください。

source: Use the stride(from:to:by:) function to create StrideTo instances.
ja: stride(from:to:by:)関数を使ってStrideToインスタンスを作成してください。

source: Use the Unicode.Scalar type to work with decoded Unicode scalar values.
ja: Unicode.Scalar型を使ってデコードされたユニコードスカラー値を扱ってください。

source: Use the closed range operator (...) to create a closed range of any type that conforms to the Comparable protocol.
ja: 完結範囲演算子（...）を使ってComparableプロトコルに準拠する何らかの型の配列を作成します。

source: Use the half-open range operator (..<) to create a range of any type that conforms to the Comparable protocol.
ja: 半開範囲演算子（..<）を使ってComparableプロトコルに準拠する何らかの型の配列を作成します。

source: Use the masking left shift operator (&<<) when you need to perform a shift and are sure that the shift amount is in the range 0..<lhs.bitWidth.
ja: マスク左シフト演算子（&<<）を、あなたがあるシフトを実行する、そしてシフト量が範囲0..<lhs.bitWidthの中であるのを確実にする必要がある場合に使ってください。

source: Use the masking right shift operator (&>>) when you need to perform a shift and are sure that the shift amount is in the range 0..<lhs.bitWidth.
ja: マスク右シフト演算子（&>>）を、あなたがあるシフトを実行する、そしてシフト量が範囲0..<lhs.bitWidthの中であるのを確実にする必要がある場合に使ってください。

source: Use the postfix range operator (postfix ...) to create a partial range of any type that conforms to the Comparable protocol.
ja: 後置完結範囲演算子（後置...）を使うことで何らかの型の部分的な範囲でComparableプロトコルに準拠するものを作成してください。

source: Use the prefix closed range operator (prefix ...) to create a partial range of any type that conforms to the Comparable protocol.
ja: 前置完結範囲演算子（前置...）を使うことで何らかの型の部分的な範囲でComparableプロトコルに準拠するものを作成してください。

source: Use the prefix half-open range operator (prefix ..<) to create a partial range of any type that conforms to the Comparable protocol.
ja: 前置半開範囲演算子（前置..<）を使うことで何らかの型の部分的な範囲でComparableプロトコルに準拠するものを作成してください。

source: Use these functions with numeric values and other comparable types.
ja: これらの関数を数値および他の比較可能な型で使ってください。

source: Use these lazy wrappers to defer any filtering or transformation of collection elements until elements are accessed.
ja: これらの遅延ラッパーを使うことで、コレクション要素の何らかの変換またはフィルタを要素がアクセスされるまで延期してください。

source: Use this information to estimate the amount of storage you will need.
ja: この情報を使って、あなたが必要とするストレージの総量を見積もってください。

source: Use this initializer to convert an instance of any type to its custom debugging representation.
ja: このイニシャライザを使って、何らかの型のインスタンスをそれのあつらえのデバッグ表現に変換してください。

source: Use this initializer to convert an instance of any type to its preferred representation as a String instance.
ja: このイニシャライザを使って、何らかの型のインスタンスをそれのより好まれる表現であるStringに変換してください。

source: Use this initializer to convert from another integer type when you know the value is within the bounds of this type.
ja: このイニシャライザを使って別の整数型から変換してください、値がこの型の境界の内部であるのをあなたが知っている場合は。
